goals_app/app/models/user.rb

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "jgv5asPIdIucK27xqudXXw"], ["updated_at", "2018-07-13 23:13:32.653680"], ["id", 18]]